<?
if(!isset($_REQUEST['VERSION'])){
	$_REQUEST['VERSION'] = '0.8.0';
}
	$arVersion = array(
		'0.8.0' => array(
			'Исправление мелких ошибок',
			'Добавление мульти полей для элементов',
		),
		'0.8.1' => array(
			'Исправление корзины',
			'Добавление функционала изменения цен',
		),
		'0.8.2' => array(
			'Исправление ошибок графиков статистики',
			'Исправление компонента бэкапов',
			'Появился логотип',
		),
		'0.8.3' => array(
			'Добавление файлового менеджера',
			'В редактор добавлен выбор цвета',
			'Добавлено редактирование полей элементов в списке',
			'Апгрейд функционала компонента статистики',
		),
		'0.8.4' => array(
			'Новый вид полей для элементов: выбор файла',
			'Исправление ошибки отправки сразу двух уведомлений на email',
		),
		'0.8.5' => array(
			'Улучшение функционала загрузки фото для элементов',
		),
		'0.8.6' => array(
			'Добавление поддержки кеширования: apc, apcu, memcache',
			'Расширение и добавление API для изображений',
			'Ускорение работы',
		),
		'0.8.7' => array(
			'Улучшение работы системы обновлений',
			'Добавление в редактор загрузку изображений на сервер',
		),
		'0.8.8' => array(
			'Реализация автоматического обновления',
		),
		'0.8.9' => array(
			'Реализация восстановления элементов из последний действий',
		),
		'0.8.9.5' => array(
			'Исправление ошибок с доступом файлов',
		),
		'0.8.9.8' => array(
			'Автоматическое исправление доступов к файлам',
		),
		'0.8.9.9' => array(
			'Добавление поиска по карте 2gis',
		),
		'0.9.0.0' => array(
			'Улучшние визуального редактирования',
			'Реализация уведомлений в верхней панели'
		),
		'0.9.0.1' => array(
			'Улучшние визуального редактирования',
			'Добавлен информер последних действий',
		),
		'0.9.0.2' => array(
			'Модернизация информера хостинга',
			'Исправления ошибок',
			'Добавлен информер файрвола',
			'Реализация древа дял выбора категорий товарам'
		),
		'0.9.0.3' => array(
			'Улучшение интерфейса административной части',
			'Исправления ошибок',
			'Добавлен компонент позволяющий читать логи',
		),
		'0.9.0.4' => array(
			'Добавлен компонент проверки сервера на совместимость',
			'Исправление стандартных шаблонов компонентов',
			'Исправления ошибок кеширования, мелкие улучшения интерфейса',
		),
	);
?>
<ul>
<?
$thisVersionClear = preg_replace("/[^0-9]/", '', $_REQUEST['VERSION']);
foreach ($arVersion as $version => $arElement) {
	$versionClear = preg_replace("/[^0-9]/", '', $version);
	if($versionClear > $thisVersionClear){
	?>
	<p><b><?=$version?></b>:</p>
	<?
		foreach ($arElement as $key => $value) {?>
	<li><?=$value?></li>
<?	}
}?>
</ul>
<?}?>